Group2/app/controllers/alerts_controller.rb

SELECT "alerts".* FROM "alerts"
---
    def index
    @alerts = Alert.all

INSERT INTO "alerts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "kdjkd"], ["created_at", "2016-05-11 02:05:59.805159"], ["updated_at", "2016-05-11 02:05:59.805159"]]
---
  def create
    @alert= Alert.new(message_params)
    if @alert.save