Group2/app/controllers/audit_controller.rb

  def request_doc
    @purch = Purchase.all
    @temp3 = AccessAudit.find_by_email(current_user.email)
---
SELECT  "access_audits".* FROM "access_audits" WHERE "access_audits"."email" = ? LIMIT 1  [["email", "auditor@gmail.com"]]