Group2/app/controllers/budgets_controller.rb

SELECT "budget_manages".* FROM "budget_manages"
---
  def new
      @budgets = BudgetManage.all