Group2/app/controllers/charges_controller.rb

	def create
	  # Amount in cents
	  #@amount = 500

	  customer = Stripe::Customer.create(
	    :email => params[:stripeEmail],
	    :source  => params[:stripeToken]
	  )
		total = Integer ($amount.round(2)*100)
		purchase = Purchase.new(:user_id => current_user.id, :total => $amount.round(2))
		purchase.save
		$cart.each do |id, quantity|
			purchase.receipts.create(:product_id => id, :quantity => quantity)
---
INSERT INTO "purchases" ("user_id", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["total", 57.949999999999996], ["created_at", "2016-05-11 18:05:42.418554"], ["updated_at", "2016-05-11 18:05:42.418554"]]
INSERT INTO "receipts" ("product_id", "purchase_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["purchase_id", 1], ["created_at", "2016-05-11 17:55:57.353806"], ["updated_at", "2016-05-11 17:55:57.353806"]]