Group2/app/controllers/conversations_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @recipients = User.all - [current_user]