Group2/app/controllers/home_controller.rb

SELECT "access_audits".* FROM "access_audits"
SELECT  "access_audits".* FROM "access_audits" WHERE "access_audits"."email" = ? LIMIT 1  [["email", ""]]
UPDATE "access_audits" SET "access" = ?, "updated_at" = ? WHERE "access_audits"."id" = ?  [["access", "t"], ["updated_at", "2016-05-12 04:32:23.416116"], ["id", 3]]
---
  def home
    @auditRequest = AccessAudit.all
    @temper = params[:truePermission]
    if params[:truePermission] && params[:auditor]
    @temp = AccessAudit.find_by_email(params[:auditor])
      @temp.access = params[:truePermission]
      @temp.save