Group2/app/controllers/inventories_controller.rb

INSERT INTO "inventories" ("name", "description", "price", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Shirt"], ["description", "Something"], ["price", 12.95], ["stock", 500], ["created_at", "2016-05-06 02:34:08.254428"], ["updated_at", "2016-05-06 02:34:08.254428"]]
---
  def create
    @inventory = Inventory.new(inventory_params)

    respond_to do |format|
      if @inventory.save