Group2/app/controllers/purchases_controller.rb

  def index
    @purchases = Purchase.all
---
SELECT `purchases`.* FROM `purchases`