Group2/app/controllers/user_config_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "test@gmail.com"]]
---
  def viewUsers
       @searchedTerm =  params[:searchterm]
       @user = User.new
    if params[:user][:email].present?