Group2/app/controllers/user_config_controller.rb

  def addUser

    email = params[:user][:email]
    pass = params[:user][:password]
    passConfirm = params[:user][:passwordConfirm]

    if email.valid? && pass != nil && passConfirm != nil



        if pass == passConfirm


          if User.find_by_email(email) ==nil
            @clients = 'New User Created'
            user = User.new(:email => email, :password => pass, :password_confirmation => passConfirm)
            user.save
          else
            @clients = 'The user already exists'
          end

        else
          @clients = 'Your Passwords did not match.'
        end
=begin
      @num = User.count
User.create(:email => 'teddy2fast@gmail.com', :encrypted_password => "password", :reset_password_token => nil, :reset_password_sent_at => nil, :remember_created_at => nil, :sign_in_count => 1, :current_sign_in_at => "2016-04-01 18:44:39", :last_sign_in_at => "2016-04-01 18:44:39", :current_sign_in_ip => "::1", :last_sign_in_ip => "::1", :created_at => "2016-04-01 18:43:53", :updated_at => "2016-04-01 18:44:39")

      @user = User.all.new
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "624ted@gmail.com"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users"