Group2/app/controllers/user_edits_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def editIt
    user = params[:userEmail]
    user_password = params[:userPassword]
    user_type = params[:userType]
    admin = User.new(:email => user, :password => 'password', :password_confirmation => 'password')
    admin.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "teddy46@gmail.com"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def addIt

    email = params[:userEmail]
    pass = params[:userPassword]
    passConfirm = params[:userPassCon]

    if email && pass != nil && passConfirm != nil



      if pass == passConfirm


        if User.find_by_email(email) ==nil
          @clients = 'New User Created'
          user = User.new(:email => email, :password => pass, :password_confirmation => passConfirm)
          user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "624ted@gmail.com"]]
---
  def deleteIt
    user = User.find_by_email(params[:userEmail]).destroy