Group2/app/controllers/users_controller.rb

UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$10$kgIMS5kQZPbIg4ZMoC4fsu04kLt79kTBou5hBgjEnHFrfrbh631Fe"], ["updated_at", "2016-05-06 00:31:46.153979"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)