Group2/app/views/user_config/addUser.html.erb

<p>Find me in app/views/user_config/addUser.html.erb</p>
<% a = User.count %>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"