Group2/app/views/user_config/viewUsers.html.erb

<% end %>
<%=  User.all.each do |product| %>
---
SELECT "users".* FROM "users"

<%= link_to("Click me to add users", "/user_config/addUser", html_options = {}) %>
<% temp = User.find_by_email(@searchedTerm) %>
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "test@gmail.com"]]