Group2/app/views/home/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
        <% Purchase.all.each do |purchase| %>
  		<b><%= User.find(purchase.id).name%> </b><br>