Group2/app/views/receipts/_receipt.html.erb

<div>
  <% product = Product.find(receipt.product_id) %>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]