Group2/app/views/purchases/index.html.erb

    <% @purchases.each do |purchase| %>
    <% user = User.find(purchase.user_id)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]